/*
*********************************************************************************************************
*
*                                      MCU: MC9S12XS128MAL - 112Pin
*                                      OSC: 16.000MHz
*                                      BUS: 32.0MHz
*									Describe: 1 ms Timer Interrupts
*
* File : PIT.c
* By   : atao
*********************************************************************************************************
*/
#include "Include.h"


void PIT_Init()
{
    PITCFLMT_PITE = 0; //å®šæ—¶ä¸­æ–­é€šé“0å…³
    PITCE_PCE0 = 1; //å®šæ—¶å™¨é€šé“0ä½¿èƒ½
	PITMUX = 0x00;
    PITMTLD0 = 159; //8ä½å®šæ—¶å™¨åˆå€¼è®¾å®š,160åˆ†é¢‘  T=  (159+1)/f(BUS) =160/8M =20us
    PITLD0 = 399;   //16ä½å®šæ—¶å™¨åˆå€¼è®¾å®š,      T=  (159+1)/f(BUS)  *(24999+1) =20us*25000=0.5
    PITINTE_PINTE0 = 1; //å®šæ—¶å™¨ä¸­æ–­é€šé“0ä¸­æ–­ä½¿èƒ½
    PITCFLMT_PITE = 1; //å®šæ—¶å™¨é€šé“0ä½¿èƒ½
}
